//*****************************************************
//*********本程序由杨一涵@2018年10月16日9：47完成*****
//*****************************************************
#include"base.h"
int main()
{
	int year,i,p;
	for (; ;)
	{
		printf("请顺序输入年:");
		scanf_s("%d", &year);
		if (((year % 4 == 0) && (year % 100 != 0)) || (year % 400 == 0))
		{
			printf("这是闰年！\n");
			p = 29;
			search(0,0,p);
		}
		else
		{
			printf("这是平年!\n");
			p = 28;
			search(0,0,p);
		}
		printf("按0继续，按其他数字退出！\n");
		scanf_s("%d", &i);
		if (i==0)
		{
			printf("继续运行！\n");
		}
		else
		{
			break;
		}
	}
	return 0;
}